package chapter09.item66;

public class Item66 {
    /*
    네이티브 메서드의 주요 쓰임
        1. 레지스트리 같은 플랫폼 특화 기능
        2. 네이티브 코드로 작성된 기존 라이브러리를 사용
        3. 성능 개선을 목적으로 성능에 결정적인 영향을 주는 영역만 따로 네이티브 언어로 작성

    네이티브 메서드의 단점
        1. 안전하지 않으므로 네티이브 메서드를 사용하는 애플리케이션도 메모리 훼손 오류로부터 안전하지 않다.
        2. 자바보다 플랫폼을 많이타서 이식성이 낮다.
        3. 디버깅이 어렵다.
        4. 주의하지 않으면 속도가 오히려 느려질 수 있다.
        5. 가비지 컬렉터가 네이티브 메모리는 자동 회수하지 못하고, 심지어 추적할 수 없다.
        6. 자바 코드와 네이티브 코드의 경계를 넘나들 때마다 비용이 추가된다.
        7. 네이티브 메서드와 자바 코드 사이의 접착 코드를 작성하기가 귀찮은 작업이다.
    */
}
